12/data/attachments/48a36f4629423027.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_b585d80b-ed86-486a-bcf5-b496beb7c3cf</nif:username>
            <nif:friendToBeAdded>Amanda_medical_Actions_67646_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>